grevaillot/svd_tools/headers/STM32H750x/bdma.h
#pragma once 

/* --- BDMA: BDMA --------------------------------------------------- */

/** @defgroup bdma_registers BDMA Register
@{*/

/** BDMA_BDMA_ISR DMA interrupt status register **/
#define BDMA_BDMA_ISR			MMIO32(BDMA_BASE + 0x00)
/** BDMA_BDMA_IFCR DMA interrupt flag clear register **/
#define BDMA_BDMA_IFCR			MMIO32(BDMA_BASE + 0x04)
/** BDMA_BDMA_CCR1 DMA channel x configuration register **/
#define BDMA_BDMA_CCR1			MMIO32(BDMA_BASE + 0x08)
/** BDMA_BDMA_CNDTR1 DMA channel x number of data register **/
#define BDMA_BDMA_CNDTR1			MMIO32(BDMA_BASE + 0x0c)
/** BDMA_BDMA_CPAR1 This register must not be written when the channel is enabled. **/
#define BDMA_BDMA_CPAR1			MMIO32(BDMA_BASE + 0x10)
/** BDMA_BDMA_CMAR1 This register must not be written when the channel is enabled. **/
#define BDMA_BDMA_CMAR1			MMIO32(BDMA_BASE + 0x14)
/** BDMA_BDMA_CCR2 DMA channel x configuration register **/
#define BDMA_BDMA_CCR2			MMIO32(BDMA_BASE + 0x1c)
/** BDMA_BDMA_CNDTR2 DMA channel x number of data register **/
#define BDMA_BDMA_CNDTR2			MMIO32(BDMA_BASE + 0x20)
/** BDMA_BDMA_CPAR2 This register must not be written when the channel is enabled. **/
#define BDMA_BDMA_CPAR2			MMIO32(BDMA_BASE + 0x24)
/** BDMA_BDMA_CMAR2 This register must not be written when the channel is enabled. **/
#define BDMA_BDMA_CMAR2			MMIO32(BDMA_BASE + 0x28)
/** BDMA_BDMA_CCR3 DMA channel x configuration register **/
#define BDMA_BDMA_CCR3			MMIO32(BDMA_BASE + 0x30)
/** BDMA_BDMA_CNDTR3 DMA channel x number of data register **/
#define BDMA_BDMA_CNDTR3			MMIO32(BDMA_BASE + 0x34)
/** BDMA_BDMA_CPAR3 This register must not be written when the channel is enabled. **/
#define BDMA_BDMA_CPAR3			MMIO32(BDMA_BASE + 0x38)
/** BDMA_BDMA_CMAR3 This register must not be written when the channel is enabled. **/
#define BDMA_BDMA_CMAR3			MMIO32(BDMA_BASE + 0x3c)
/** BDMA_BDMA_CCR4 DMA channel x configuration register **/
#define BDMA_BDMA_CCR4			MMIO32(BDMA_BASE + 0x44)
/** BDMA_BDMA_CNDTR4 DMA channel x number of data register **/
#define BDMA_BDMA_CNDTR4			MMIO32(BDMA_BASE + 0x48)
/** BDMA_BDMA_CPAR4 This register must not be written when the channel is enabled. **/
#define BDMA_BDMA_CPAR4			MMIO32(BDMA_BASE + 0x4c)
/** BDMA_BDMA_CMAR4 This register must not be written when the channel is enabled. **/
#define BDMA_BDMA_CMAR4			MMIO32(BDMA_BASE + 0x50)
/** BDMA_BDMA_CCR5 DMA channel x configuration register **/
#define BDMA_BDMA_CCR5			MMIO32(BDMA_BASE + 0x58)
/** BDMA_BDMA_CNDTR5 DMA channel x number of data register **/
#define BDMA_BDMA_CNDTR5			MMIO32(BDMA_BASE + 0x5c)
/** BDMA_BDMA_CPAR5 This register must not be written when the channel is enabled. **/
#define BDMA_BDMA_CPAR5			MMIO32(BDMA_BASE + 0x60)
/** BDMA_BDMA_CMAR5 This register must not be written when the channel is enabled. **/
#define BDMA_BDMA_CMAR5			MMIO32(BDMA_BASE + 0x64)
/** BDMA_BDMA_CCR6 DMA channel x configuration register **/
#define BDMA_BDMA_CCR6			MMIO32(BDMA_BASE + 0x6c)
/** BDMA_BDMA_CNDTR6 DMA channel x number of data register **/
#define BDMA_BDMA_CNDTR6			MMIO32(BDMA_BASE + 0x70)
/** BDMA_BDMA_CPAR6 This register must not be written when the channel is enabled. **/
#define BDMA_BDMA_CPAR6			MMIO32(BDMA_BASE + 0x74)
/** BDMA_BDMA_CMAR6 This register must not be written when the channel is enabled. **/
#define BDMA_BDMA_CMAR6			MMIO32(BDMA_BASE + 0x78)
/** BDMA_BDMA_CCR7 DMA channel x configuration register **/
#define BDMA_BDMA_CCR7			MMIO32(BDMA_BASE + 0x80)
/** BDMA_BDMA_CNDTR7 DMA channel x number of data register **/
#define BDMA_BDMA_CNDTR7			MMIO32(BDMA_BASE + 0x84)
/** BDMA_BDMA_CPAR7 This register must not be written when the channel is enabled. **/
#define BDMA_BDMA_CPAR7			MMIO32(BDMA_BASE + 0x88)
/** BDMA_BDMA_CMAR7 This register must not be written when the channel is enabled. **/
#define BDMA_BDMA_CMAR7			MMIO32(BDMA_BASE + 0x8c)
/** BDMA_BDMA_CCR8 DMA channel x configuration register **/
#define BDMA_BDMA_CCR8			MMIO32(BDMA_BASE + 0x94)
/** BDMA_BDMA_CNDTR8 DMA channel x number of data register **/
#define BDMA_BDMA_CNDTR8			MMIO32(BDMA_BASE + 0x98)
/** BDMA_BDMA_CPAR8 This register must not be written when the channel is enabled. **/
#define BDMA_BDMA_CPAR8			MMIO32(BDMA_BASE + 0x9c)
/** BDMA_BDMA_CMAR8 This register must not be written when the channel is enabled. **/
#define BDMA_BDMA_CMAR8			MMIO32(BDMA_BASE + 0xa0)

/**@}*/


/** @defgroup bdma_bdma_isr BDMAISR DMA interrupt status register
@{*/

/** BDMA_BDMA_ISR_TEIF8 Channel x transfer error flag (x = 1..8) This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register. **/
#define BDMA_BDMA_ISR_TEIF8		(1 << 31)
/** BDMA_BDMA_ISR_HTIF8 Channel x half transfer flag (x = 1..8) This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register. **/
#define BDMA_BDMA_ISR_HTIF8		(1 << 30)
/** BDMA_BDMA_ISR_TCIF8 Channel x transfer complete flag (x = 1..8) This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register. **/
#define BDMA_BDMA_ISR_TCIF8		(1 << 29)
/** BDMA_BDMA_ISR_GIF8 Channel x global interrupt flag (x = 1..8) This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register. **/
#define BDMA_BDMA_ISR_GIF8		(1 << 28)
/** BDMA_BDMA_ISR_TEIF7 Channel x transfer error flag (x = 1..8) This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register. **/
#define BDMA_BDMA_ISR_TEIF7		(1 << 27)
/** BDMA_BDMA_ISR_HTIF7 Channel x half transfer flag (x = 1..8) This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register. **/
#define BDMA_BDMA_ISR_HTIF7		(1 << 26)
/** BDMA_BDMA_ISR_TCIF7 Channel x transfer complete flag (x = 1..8) This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register. **/
#define BDMA_BDMA_ISR_TCIF7		(1 << 25)
/** BDMA_BDMA_ISR_GIF7 Channel x global interrupt flag (x = 1..8) This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register. **/
#define BDMA_BDMA_ISR_GIF7		(1 << 24)
/** BDMA_BDMA_ISR_TEIF6 Channel x transfer error flag (x = 1..8) This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register. **/
#define BDMA_BDMA_ISR_TEIF6		(1 << 23)
/** BDMA_BDMA_ISR_HTIF6 Channel x half transfer flag (x = 1..8) This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register. **/
#define BDMA_BDMA_ISR_HTIF6		(1 << 22)
/** BDMA_BDMA_ISR_TCIF6 Channel x transfer complete flag (x = 1..8) This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register. **/
#define BDMA_BDMA_ISR_TCIF6		(1 << 21)
/** BDMA_BDMA_ISR_GIF6 Channel x global interrupt flag (x = 1..8) This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register. **/
#define BDMA_BDMA_ISR_GIF6		(1 << 20)
/** BDMA_BDMA_ISR_TEIF5 Channel x transfer error flag (x = 1..8) This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register. **/
#define BDMA_BDMA_ISR_TEIF5		(1 << 19)
/** BDMA_BDMA_ISR_HTIF5 Channel x half transfer flag (x = 1..8) This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register. **/
#define BDMA_BDMA_ISR_HTIF5		(1 << 18)
/** BDMA_BDMA_ISR_TCIF5 Channel x transfer complete flag (x = 1..8) This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register. **/
#define BDMA_BDMA_ISR_TCIF5		(1 << 17)
/** BDMA_BDMA_ISR_GIF5 Channel x global interrupt flag (x = 1..8) This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register. **/
#define BDMA_BDMA_ISR_GIF5		(1 << 16)
/** BDMA_BDMA_ISR_TEIF4 Channel x transfer error flag (x = 1..8) This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register. **/
#define BDMA_BDMA_ISR_TEIF4		(1 << 15)
/** BDMA_BDMA_ISR_HTIF4 Channel x half transfer flag (x = 1..8) This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register. **/
#define BDMA_BDMA_ISR_HTIF4		(1 << 14)
/** BDMA_BDMA_ISR_TCIF4 Channel x transfer complete flag (x = 1..8) This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register. **/
#define BDMA_BDMA_ISR_TCIF4		(1 << 13)
/** BDMA_BDMA_ISR_GIF4 Channel x global interrupt flag (x = 1..8) This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register. **/
#define BDMA_BDMA_ISR_GIF4		(1 << 12)
/** BDMA_BDMA_ISR_TEIF3 Channel x transfer error flag (x = 1..8) This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register. **/
#define BDMA_BDMA_ISR_TEIF3		(1 << 11)
/** BDMA_BDMA_ISR_HTIF3 Channel x half transfer flag (x = 1..8) This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register. **/
#define BDMA_BDMA_ISR_HTIF3		(1 << 10)
/** BDMA_BDMA_ISR_TCIF3 Channel x transfer complete flag (x = 1..8) This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register. **/
#define BDMA_BDMA_ISR_TCIF3		(1 << 9)
/** BDMA_BDMA_ISR_GIF3 Channel x global interrupt flag (x = 1..8) This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register. **/
#define BDMA_BDMA_ISR_GIF3		(1 << 8)
/** BDMA_BDMA_ISR_TEIF2 Channel x transfer error flag (x = 1..8) This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register. **/
#define BDMA_BDMA_ISR_TEIF2		(1 << 7)
/** BDMA_BDMA_ISR_HTIF2 Channel x half transfer flag (x = 1..8) This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register. **/
#define BDMA_BDMA_ISR_HTIF2		(1 << 6)
/** BDMA_BDMA_ISR_TCIF2 Channel x transfer complete flag (x = 1..8) This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register. **/
#define BDMA_BDMA_ISR_TCIF2		(1 << 5)
/** BDMA_BDMA_ISR_GIF2 Channel x global interrupt flag (x = 1..8) This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register. **/
#define BDMA_BDMA_ISR_GIF2		(1 << 4)
/** BDMA_BDMA_ISR_TEIF1 Channel x transfer error flag (x = 1..8) This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register. **/
#define BDMA_BDMA_ISR_TEIF1		(1 << 3)
/** BDMA_BDMA_ISR_HTIF1 Channel x half transfer flag (x = 1..8) This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register. **/
#define BDMA_BDMA_ISR_HTIF1		(1 << 2)
/** BDMA_BDMA_ISR_TCIF1 Channel x transfer complete flag (x = 1..8) This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register. **/
#define BDMA_BDMA_ISR_TCIF1		(1 << 1)
/** BDMA_BDMA_ISR_GIF1 Channel x global interrupt flag (x = 1..8) This bit is set by hardware. It is cleared by software writing 1 to the corresponding bit in the DMA_IFCR register. **/
#define BDMA_BDMA_ISR_GIF1		(1 << 0)

/**@}*/

/** @defgroup bdma_bdma_ifcr BDMAIFCR DMA interrupt flag clear register
@{*/

