grevaillot/svd_tools/headers/STM32H750x/bdma.h
/** BDMA_BDMA_IFCR_CTEIF8 Channel x transfer error clear This bit is set and cleared by software. **/
#define BDMA_BDMA_IFCR_CTEIF8		(1 << 31)
/** BDMA_BDMA_IFCR_CHTIF8 Channel x half transfer clear This bit is set and cleared by software. **/
#define BDMA_BDMA_IFCR_CHTIF8		(1 << 30)
/** BDMA_BDMA_IFCR_CTCIF8 Channel x transfer complete clear This bit is set and cleared by software. **/
#define BDMA_BDMA_IFCR_CTCIF8		(1 << 29)
/** BDMA_BDMA_IFCR_CGIF8 Channel x global interrupt clear This bit is set and cleared by software. **/
#define BDMA_BDMA_IFCR_CGIF8		(1 << 28)
/** BDMA_BDMA_IFCR_CTEIF7 Channel x transfer error clear This bit is set and cleared by software. **/
#define BDMA_BDMA_IFCR_CTEIF7		(1 << 27)
/** BDMA_BDMA_IFCR_CHTIF7 Channel x half transfer clear This bit is set and cleared by software. **/
#define BDMA_BDMA_IFCR_CHTIF7		(1 << 26)
/** BDMA_BDMA_IFCR_CTCIF7 Channel x transfer complete clear This bit is set and cleared by software. **/
#define BDMA_BDMA_IFCR_CTCIF7		(1 << 25)
/** BDMA_BDMA_IFCR_CGIF7 Channel x global interrupt clear This bit is set and cleared by software. **/
#define BDMA_BDMA_IFCR_CGIF7		(1 << 24)
/** BDMA_BDMA_IFCR_CTEIF6 Channel x transfer error clear This bit is set and cleared by software. **/
#define BDMA_BDMA_IFCR_CTEIF6		(1 << 23)
/** BDMA_BDMA_IFCR_CHTIF6 Channel x half transfer clear This bit is set and cleared by software. **/
#define BDMA_BDMA_IFCR_CHTIF6		(1 << 22)
/** BDMA_BDMA_IFCR_CTCIF6 Channel x transfer complete clear This bit is set and cleared by software. **/
#define BDMA_BDMA_IFCR_CTCIF6		(1 << 21)
/** BDMA_BDMA_IFCR_CGIF6 Channel x global interrupt clear This bit is set and cleared by software. **/
#define BDMA_BDMA_IFCR_CGIF6		(1 << 20)
/** BDMA_BDMA_IFCR_CTEIF5 Channel x transfer error clear This bit is set and cleared by software. **/
#define BDMA_BDMA_IFCR_CTEIF5		(1 << 19)
/** BDMA_BDMA_IFCR_CHTIF5 Channel x half transfer clear This bit is set and cleared by software. **/
#define BDMA_BDMA_IFCR_CHTIF5		(1 << 18)
/** BDMA_BDMA_IFCR_CTCIF5 Channel x transfer complete clear This bit is set and cleared by software. **/
#define BDMA_BDMA_IFCR_CTCIF5		(1 << 17)
/** BDMA_BDMA_IFCR_CGIF5 Channel x global interrupt clear This bit is set and cleared by software. **/
#define BDMA_BDMA_IFCR_CGIF5		(1 << 16)
/** BDMA_BDMA_IFCR_CTEIF4 Channel x transfer error clear This bit is set and cleared by software. **/
#define BDMA_BDMA_IFCR_CTEIF4		(1 << 15)
/** BDMA_BDMA_IFCR_CHTIF4 Channel x half transfer clear This bit is set and cleared by software. **/
#define BDMA_BDMA_IFCR_CHTIF4		(1 << 14)
/** BDMA_BDMA_IFCR_CTCIF4 Channel x transfer complete clear This bit is set and cleared by software. **/
#define BDMA_BDMA_IFCR_CTCIF4		(1 << 13)
/** BDMA_BDMA_IFCR_CGIF4 Channel x global interrupt clear This bit is set and cleared by software. **/
#define BDMA_BDMA_IFCR_CGIF4		(1 << 12)
/** BDMA_BDMA_IFCR_CTEIF3 Channel x transfer error clear This bit is set and cleared by software. **/
#define BDMA_BDMA_IFCR_CTEIF3		(1 << 11)
/** BDMA_BDMA_IFCR_CHTIF3 Channel x half transfer clear This bit is set and cleared by software. **/
#define BDMA_BDMA_IFCR_CHTIF3		(1 << 10)
/** BDMA_BDMA_IFCR_CTCIF3 Channel x transfer complete clear This bit is set and cleared by software. **/
#define BDMA_BDMA_IFCR_CTCIF3		(1 << 9)
/** BDMA_BDMA_IFCR_CGIF3 Channel x global interrupt clear This bit is set and cleared by software. **/
#define BDMA_BDMA_IFCR_CGIF3		(1 << 8)
/** BDMA_BDMA_IFCR_CTEIF2 Channel x transfer error clear This bit is set and cleared by software. **/
#define BDMA_BDMA_IFCR_CTEIF2		(1 << 7)
/** BDMA_BDMA_IFCR_CHTIF2 Channel x half transfer clear This bit is set and cleared by software. **/
#define BDMA_BDMA_IFCR_CHTIF2		(1 << 6)
/** BDMA_BDMA_IFCR_CTCIF2 Channel x transfer complete clear This bit is set and cleared by software. **/
#define BDMA_BDMA_IFCR_CTCIF2		(1 << 5)
/** BDMA_BDMA_IFCR_CGIF2 Channel x global interrupt clear This bit is set and cleared by software. **/
#define BDMA_BDMA_IFCR_CGIF2		(1 << 4)
/** BDMA_BDMA_IFCR_CTEIF1 Channel x transfer error clear This bit is set and cleared by software. **/
#define BDMA_BDMA_IFCR_CTEIF1		(1 << 3)
/** BDMA_BDMA_IFCR_CHTIF1 Channel x half transfer clear This bit is set and cleared by software. **/
#define BDMA_BDMA_IFCR_CHTIF1		(1 << 2)
/** BDMA_BDMA_IFCR_CTCIF1 Channel x transfer complete clear This bit is set and cleared by software. **/
#define BDMA_BDMA_IFCR_CTCIF1		(1 << 1)
/** BDMA_BDMA_IFCR_CGIF1 Channel x global interrupt clear This bit is set and cleared by software. **/
#define BDMA_BDMA_IFCR_CGIF1		(1 << 0)

/**@}*/

/** @defgroup bdma_bdma_ccr1 BDMACCR1 DMA channel x configuration register
@{*/

/** BDMA_BDMA_CCR1_MEM2MEM Memory to memory mode This bit is set and cleared by software. **/
#define BDMA_BDMA_CCR1_MEM2MEM		(1 << 14)

#define BDMA_BDMA_CCR1_PL_SHIFT		12
#define BDMA_BDMA_CCR1_PL_MASK		0x03
/** @defgroup bdma_bdma_ccr1_pl PL Channel priority level These bits are set and cleared by software.
@{*/
/**@}*/


#define BDMA_BDMA_CCR1_MSIZE_SHIFT		10
#define BDMA_BDMA_CCR1_MSIZE_MASK		0x03
/** @defgroup bdma_bdma_ccr1_msize MSIZE Memory size These bits are set and cleared by software.
@{*/
/**@}*/


#define BDMA_BDMA_CCR1_PSIZE_SHIFT		8
#define BDMA_BDMA_CCR1_PSIZE_MASK		0x03
/** @defgroup bdma_bdma_ccr1_psize PSIZE Peripheral size These bits are set and cleared by software.
@{*/
/**@}*/

/** BDMA_BDMA_CCR1_MINC Memory increment mode This bit is set and cleared by software. **/
#define BDMA_BDMA_CCR1_MINC		(1 << 7)
/** BDMA_BDMA_CCR1_PINC Peripheral increment mode This bit is set and cleared by software. **/
#define BDMA_BDMA_CCR1_PINC		(1 << 6)
/** BDMA_BDMA_CCR1_CIRC Circular mode This bit is set and cleared by software. **/
#define BDMA_BDMA_CCR1_CIRC		(1 << 5)
/** BDMA_BDMA_CCR1_DIR Data transfer direction This bit is set and cleared by software. **/
#define BDMA_BDMA_CCR1_DIR		(1 << 4)
/** BDMA_BDMA_CCR1_TEIE Transfer error interrupt enable This bit is set and cleared by software. **/
#define BDMA_BDMA_CCR1_TEIE		(1 << 3)
/** BDMA_BDMA_CCR1_HTIE Half transfer interrupt enable This bit is set and cleared by software. **/
#define BDMA_BDMA_CCR1_HTIE		(1 << 2)
/** BDMA_BDMA_CCR1_TCIE Transfer complete interrupt enable This bit is set and cleared by software. **/
#define BDMA_BDMA_CCR1_TCIE		(1 << 1)
/** BDMA_BDMA_CCR1_EN Channel enable This bit is set and cleared by software. **/
#define BDMA_BDMA_CCR1_EN		(1 << 0)

/**@}*/

/** @defgroup bdma_bdma_cndtr1 BDMACNDTR1 DMA channel x number of data register
@{*/


#define BDMA_BDMA_CNDTR1_NDT_SHIFT		0
#define BDMA_BDMA_CNDTR1_NDT_MASK		0xffff
/** @defgroup bdma_bdma_cndtr1_ndt NDT Number of data to transfer Number of data to be transferred (0 up to 65535). This register can only be written when the channel is disabled. Once the channel is enabled, this register is read-only, indicating the remaining bytes to be transmitted. This register decrements after each DMA transfer. Once the transfer is completed, this register can either stay at zero or be reloaded automatically by the value previously programmed if the channel is configured in auto-reload mode. If this register is zero, no transaction can be served whether the channel is enabled or not.
@{*/
/**@}*/


/**@}*/

