grevaillot/svd_tools/headers/STM32H750x/bdma.h
#define BDMA_BDMA_CCR8_MSIZE_SHIFT		10
#define BDMA_BDMA_CCR8_MSIZE_MASK		0x03
/** @defgroup bdma_bdma_ccr8_msize MSIZE Memory size These bits are set and cleared by software.
@{*/
/**@}*/


#define BDMA_BDMA_CCR8_PSIZE_SHIFT		8
#define BDMA_BDMA_CCR8_PSIZE_MASK		0x03
/** @defgroup bdma_bdma_ccr8_psize PSIZE Peripheral size These bits are set and cleared by software.
@{*/
/**@}*/

/** BDMA_BDMA_CCR8_MINC Memory increment mode This bit is set and cleared by software. **/
#define BDMA_BDMA_CCR8_MINC		(1 << 7)
/** BDMA_BDMA_CCR8_PINC Peripheral increment mode This bit is set and cleared by software. **/
#define BDMA_BDMA_CCR8_PINC		(1 << 6)
/** BDMA_BDMA_CCR8_CIRC Circular mode This bit is set and cleared by software. **/
#define BDMA_BDMA_CCR8_CIRC		(1 << 5)
/** BDMA_BDMA_CCR8_DIR Data transfer direction This bit is set and cleared by software. **/
#define BDMA_BDMA_CCR8_DIR		(1 << 4)
/** BDMA_BDMA_CCR8_TEIE Transfer error interrupt enable This bit is set and cleared by software. **/
#define BDMA_BDMA_CCR8_TEIE		(1 << 3)
/** BDMA_BDMA_CCR8_HTIE Half transfer interrupt enable This bit is set and cleared by software. **/
#define BDMA_BDMA_CCR8_HTIE		(1 << 2)
/** BDMA_BDMA_CCR8_TCIE Transfer complete interrupt enable This bit is set and cleared by software. **/
#define BDMA_BDMA_CCR8_TCIE		(1 << 1)
/** BDMA_BDMA_CCR8_EN Channel enable This bit is set and cleared by software. **/
#define BDMA_BDMA_CCR8_EN		(1 << 0)

/**@}*/

/** @defgroup bdma_bdma_cndtr8 BDMACNDTR8 DMA channel x number of data register
@{*/


#define BDMA_BDMA_CNDTR8_NDT_SHIFT		0
#define BDMA_BDMA_CNDTR8_NDT_MASK		0xffff
/** @defgroup bdma_bdma_cndtr8_ndt NDT Number of data to transfer Number of data to be transferred (0 up to 65535). This register can only be written when the channel is disabled. Once the channel is enabled, this register is read-only, indicating the remaining bytes to be transmitted. This register decrements after each DMA transfer. Once the transfer is completed, this register can either stay at zero or be reloaded automatically by the value previously programmed if the channel is configured in auto-reload mode. If this register is zero, no transaction can be served whether the channel is enabled or not.
@{*/
/**@}*/


/**@}*/

/** @defgroup bdma_bdma_cpar8 BDMACPAR8 This register must not be written when the channel is enabled.
@{*/


#define BDMA_BDMA_CPAR8_PA_SHIFT		0
#define BDMA_BDMA_CPAR8_PA_MASK		0xffffffff
/** @defgroup bdma_bdma_cpar8_pa PA Peripheral address Base address of the peripheral data register from/to which the data will be read/written. When PSIZE is 01 (16-bit), the PA[0] bit is ignored. Access is automatically aligned to a half-word address. When PSIZE is 10 (32-bit), PA[1:0] are ignored. Access is automatically aligned to a word address.
@{*/
/**@}*/


/**@}*/

/** @defgroup bdma_bdma_cmar8 BDMACMAR8 This register must not be written when the channel is enabled.
@{*/


#define BDMA_BDMA_CMAR8_MA_SHIFT		0
#define BDMA_BDMA_CMAR8_MA_MASK		0xffffffff
/** @defgroup bdma_bdma_cmar8_ma MA Memory address Base address of the memory area from/to which the data will be read/written. When MSIZE is 01 (16-bit), the MA[0] bit is ignored. Access is automatically aligned to a half-word address. When MSIZE is 10 (32-bit), MA[1:0] are ignored. Access is automatically aligned to a word address.
@{*/
/**@}*/


/**@}*/
